app/views/drinks/show.html.erb

<%= image_tag("#{@drink.img_url}") %>
  <% @drink.zodiacs.each do |name| %>
---
SELECT "zodiacs".* FROM "zodiacs" INNER JOIN "zodiac_drinks" ON "zodiacs"."id" = "zodiac_drinks"."zodiac_id" WHERE "zodiac_drinks"."drink_id" = ?  [["drink_id", 37]]

  <% end %>
<% @drink.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "user_drinks" ON "users"."id" = "user_drinks"."user_id" WHERE "user_drinks"."drink_id" = ?  [["drink_id", 37]]