app/views/zodiacs/show.html.erb

SELECT "drinks".* FROM "drinks" INNER JOIN "zodiac_drinks" ON "drinks"."id" = "zodiac_drinks"."drink_id" WHERE "zodiac_drinks"."zodiac_id" = ?  [["zodiac_id", 1]]
---

<% @zodiac.drinks.each do |drink| %>