app/views/users/edit.html.erb

  <%= f.label "Star Sign" %>
  <%= f.collection_select :zodiac_id, Zodiac.all, :id, :zodiac_name %>
---
SELECT "zodiacs".* FROM "zodiacs"