app/views/users/new.html.erb

SELECT "zodiacs".* FROM "zodiacs"
---
  <%= f.label "Star Sign" %>
  <%= f.collection_select :zodiac_id, Zodiac.all, :id, :zodiac_name %>