app/views/users/show.html.erb

  <h3>Your drinks</h3>
  <% @user.drinks.each do |drink| %>
---
SELECT "drinks".* FROM "drinks" INNER JOIN "user_drinks" ON "drinks"."id" = "user_drinks"."drink_id" WHERE "user_drinks"."user_id" = ?  [["user_id", 5]]