app/controllers/drinks_controller.rb

SELECT "drinks".* FROM "drinks"
---
  def index
    @drinks = Drink.all

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def show
    @drink = Drink.find(params[:id])

INSERT INTO "drinks" ("drink_name", "category", "img_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @drink = Drink.new(drink_params)
    @drink.save

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def edit
    @drink = Drink.find(params[:id])

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
UPDATE "drinks" SET "drink_name" = ?, "category" = ?, "updated_at" = ? WHERE "drinks"."id" = ?  [["drink_name", "VadimDrank"], ["category", "manly drink number 1"], ["updated_at", "2018-09-13 17:14:15.753377"], ["id", 37]]
---
  def update
    @drink = Drink.find(params[:id])
    @drink.update(drink_params)

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
DELETE FROM "drinks" WHERE "drinks"."id" = ?  [["id", 29]]
---
  def destroy
    @drink = Drink.find(params[:id])
    @drink.destroy