app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def create
    # POST /sessions
    # byebug

    @user = User.find_by(username: params["username"])