app/controllers/sessions_controller.rb

  def create
    # POST /sessions
    # byebug

    @user = User.find_by(email: params["email"])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "hbarlar1@gmail.com"], ["LIMIT", 1]]