app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "password_digest", "zodiac_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$w6luP3NqjPWuahOobDJ8IODRsSSgJ9bBK1QwWJN1Rrxxyq.k2vVs."], ["updated_at", "2018-09-11 19:03:35.080729"], ["id", 2]]