app/controllers/zodiacs_controller.rb

  def index
    # byebug
    @zodiacs = Zodiac.all
---
SELECT "zodiacs".* FROM "zodiacs"

  def show
    @zodiac = Zodiac.find(params[:id])
---
SELECT  "zodiacs".* FROM "zodiacs" WHERE "zodiacs"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]